package logger

// levels
const (
	Info  = "info"
	Debug = "debug"
	Query = "query"
	//Critical = "critical"
	//Warning  = "warning"
	Error = "error"
)

//Цвет	Основной	Фон
//Стандартный	\033[39m	\033[49m
//Чёрный	\033[30m	\033[40m
//Тёмно-красный	\033[31m	\033[41m
//Тёмно-зелёный	\033[32m	\033[42m
//Тёмно-жёлтый «Оранжевый»	\033[33m	\033[43m
//Тёмно-синий	\033[34m	\033[44m
//Темно-пурпурный	\033[35m	\033[45m
//Тёмно-голубой	\033[36m	\033[46m
//Светло-серый	\033[37m	\033[47m
//Тёмно-серый	\033[90m	\033[100m
//Красный	\033[91m	\033[101m
//Зелёный	\033[92m	\033[101m
//Оранжевый	\033[93m	\033[103m
//Синий	\033[94m	\033[104m
//Пурпурный	\033[95m	\033[105m
//Голубой	\033[96m	\033[106m
//Белый	\033[97m	\033[107m

// colors
const (
	darkBlue   = "\033[34m"
	darkGreen  = "\033[32m"
	blue       = "\033[96m"
	darkPurple = "\033[35m"
	orange     = "\033[93m"
	red        = "\033[91m"
	noColor    = "\033[m"
)
